{
	"chapter_name": "Chapter 5",
	"sessions": [
		{
			"id": "session26",
			"title": "Session 26",
			"date": "March 19, 2016",
			"summary": [
				"After doing some shopping in Magnimar, Khellis teleports the party to Sandpoint where everyone asks if they are here to investigate the sinkhole. A meeting with Father Zantus, Mayor Deverin, and Sheriff Hemlock fills everyone in. Strange howls can be heard from the sinkhole at night, and a group of soldiers that went in to investigate never returned.",
				"Before going into the sinkhole, the party seeks out the town druid Madame Mvashti to understand what the stone giants were trying to learn from the Old Light when they attacked the town. Helped by younger druids who were visiting, she walks down with the party to the coast and casts <span class=\"spell-name\">stone tell</span> on a rock. She sees a vision of a dark-haired man in a tower as the world crumbled around him being killed by the tower's collapse. She also sees a vision of the same man being reborn from a pool deep underground.",
				"As they delve into the sinkhole, the heroes emerge into a familiar shrine room and are attacked by the same small winged demon they fought before. This time, they make short work of the creature before moving deeper under the complex than before. Surrounded by a deep fog, a voice asks them questions in Thassalonian about the modern time before a figure instructs a large demonic creature to attack the heroes. It catches Sarra in a spell that leaves her floating at the ceiling, and the thick fog makes it difficult for all but Icentress with her anti-fog goggles to strike the creature.",
				"Sarra purges the spell, sending her falling to the ground. Icentress lands many arrows deep into the creature, including its mouth. When the demon falls, the dark-haired man appears and attacks as well. Khellis renders the man blind, and Drakard casts <span class=\"spell-name\">grease</span> beneath the man's feet. The man lashes out at Qola with his sword, which chews the flesh of Qola's arm as it strikes. However, when the man tries to warp away, Qola interrupts his spell and the man falls.",
				"With the temple clear, Sarra finds many verses of a poem describing how to access Runeforge. The poem gives a few clues but is not clear on where the entrance lies."
			]
		},
		{
			"id": "session27",
			"title": "Session 27",
			"date": "April 30, 2016",
			"summary": [
				"Coming soon..."
			]
		}
	]
}