{
	"chapter_name": "Chapter 5",
	"sessions": [
		{
			"id": "session26",
			"title": "Session 26",
			"date": "March 19, 2016",
			"summary": [
				"After doing some shopping in Magnimar, Khellis teleports the party to Sandpoint where everyone asks if they are here to investigate the sinkhole. A meeting with Father Zantus, Mayor Deverin, and Sheriff Hemlock fills everyone in. Strange howls can be heard from the sinkhole at night, and a group of soldiers that went in to investigate never returned.",
				"Before going into the sinkhole, the party seeks out the town druid Madame Mvashti to understand what the stone giants were trying to learn from the Old Light when they attacked the town. Helped by younger druids who were visiting, she walks down with the party to the coast and casts <span class=\"spell-name\">stone tell</span> on a rock. She sees a vision of a dark-haired man in a tower as the world crumbled around him being killed by the tower's collapse. She also sees a vision of the same man being reborn from a pool deep underground.",
				"As they delve into the sinkhole, the heroes emerge into a familiar shrine room and are attacked by the same small winged demon they fought before. This time, they make short work of the creature before moving deeper under the complex than before. Surrounded by a deep fog, a voice asks them questions in Thassalonian about the modern time before a figure instructs a large demonic creature to attack the heroes. It catches Sarra in a spell that leaves her floating at the ceiling, and the thick fog makes it difficult for all but Icentress with her anti-fog goggles to strike the creature.",
				"Sarra purges the spell, sending her falling to the ground. Icentress lands many arrows deep into the creature, including its mouth. When the demon falls, the dark-haired man appears and attacks as well. Khellis renders the man blind, and Drakard casts <span class=\"spell-name\">grease</span> beneath the man's feet. The man lashes out at Qola with his sword, which chews the flesh of Qola's arm as it strikes. However, when the man tries to warp away, Qola interrupts his spell and the man falls.",
				"With the temple clear, Sarra finds many verses of a poem describing how to access Runeforge. The poem gives a few clues but is not clear on where the entrance lies."
			]
		},
		{
			"id": "session27",
			"title": "Session 27",
			"date": "April 30, 2016",
			"summary": [
				"After pouring over the poem's verses, the party also consults Brodert Quink. Together, they determine the verses must point to Rimeskull in the far nothern mountains. Khellis teleports the party to the nearest large city: Riddleport.",
				"Khellis searches to buy a ring of protection from a Calistra-affiliated store, and negotiates a discount with the store owner if he will collect a debt that a dwarven shipmate owes her. Meanwhile, Drakard goes drinking at The Flying Eel tavern and talks up a table of dwarves - one of which end up being Khellis' mark, the dwarf Grimmak. With Qola serving as muscle, Khellis demands the money from Grimmak and attracts the attention of Captain Grax of the <i>Black Trident</i>.",
				"Khellis and Qola extract the money to pay the debt (plus a little for their own troubles) from Grimmak while also avoiding a bar brawl with Grax and return to the store. Khellis is able to get his ring for his discount price, and also secures the services of a elven wizard named Ravel to teleport the party from Riddleport to Rimeskull. The party retires for the night, except for Drakard who barhops throughout Riddleport until early in the morning.",
				"The next day, everyone visits Ravel and are whisked away to Rimeskull and realize they should have come at dusk instead of mid-morning. The PCs explore the stairs leading up to a cave, and are assaulted by a pair of earth elementals. Icentress is caught close to the monsters, and takes a nasty blow from one of them. When she tries to move away, one catches her off-guard and delivers a fatal slam. Qola sprints up the staircase to join the battle, while Nala flies into a rage and begins clawing the leg of the elemental apart. The party finished off the elementals, then carry the body of their fallen comrade to the shores of Lake Stormunder.",
				"A raft is built from driftwood, and Icentress is laid across it with her gear. The party uses <span class=\"spell-name\">speak with dead</span> to tell their friend goodbye a final time, and put her cameo around Nala's neck. The raft is pushed out to the center of the lake, where Khellis ignites it with a <span class=\"spell-name\">scorching ray</span>."
			]
		},
		{
			"id": "session28",
			"title": "Session 28",
			"date": "May 15, 2016",
			"summary": [
				"The party teleports back to Magnimar to drop off Nala at the Rhynell compound. Khellis buys the components to build his own set of fog-cutting lenses, while Drakard confesses he left Khellis' magic quill in a bar in Riddleport (though he does not remember which).",
				"Returning to Riddleport, everyone follows Drakard as he retraces his steps until they lead to the bar Torag's Hammer-d. As he chats up the barkeep, the dwarven woman asks \"Have you ever heard of the house Rynell?\" She turns out to be Ingram, mother of Drakard's young dwarven squire. Hungry for adventure and to see the world, Ingram asks to join the others on their exploration of Rimeskull.",
				"Teleporting back to Rimeskull at dusk, the party start casting spells on the seven stone heads and discover that the heads produce large golden keys when they do. After collecting 3 keys, a large shadow falls across them as a white dragon roars overhead and attacks. The PCs use the stones as cover as the dragon attacks with tooth and tail as it flies by again and again. They are finally able to hit the dragon with a <span class=\"spell-name\">slow</span> spell, and it retreats back into the cave at the top of the mountain. The party decides to collect the other 4 keys, then rest for the night."
			]
		},
		{
			"id": "session29",
			"title": "Session 29",
			"date": "June 18, 2016",
			"summary": [
				"The next morning, the party climbs the stone staircase and enter the cave. Ingram's knowledge of stonework identifies a ramp to descend deep into the mountain where they find a large stone structure and a pile of treasure. Drakard, Sarra, and Khellis take holy water, a belt, a sword, and coins from the pile. Ingram considers taking some gemstones, but puts them back. They explore two tunnels in the complex, but only find empty hallways and large empty rooms.",
				"As they examine the room, the party discovers keyholes in seven pillars. By trial and error, they learn how to turn the keys to make the pillars glow. When all seven are glowing a portal opens in the center of the room. As they walk through the PCs are transported to a well-crafted stone complex, and the portal closes behind them. After walking forward a large room similar to the one they just left comes into view, revealing a bubbling pool and a statue of each Runelord standing in front of a tunnel.",
				"Exploring the tunnel associated with Envy they find a silver rod melted into the floor and arcing with arcane energy. Drakard yanks on it and sets off a pulse of magical energy. In a side room they find a pool of thick silver liquid that is rich with magical energy and Sarra takes a few vials of it."
			]
		},
		{
			"id": "session30",
			"title": "Session 30",
			"date": "July 4, 2016",
			"summary": [
				"Coming soon..."
			]
		}
	]
}