{
	"chapter_name": "Chapter 4",
	"sessions": [
		{
			"id": "session19",
			"title": "Session 19",
			"date": "October 3, 2015",
			"summary": [
				"The party takes the ferry back to Magnimar to resuppy, then travels over land back to Sandpoint. The town is as they left it, and (almost) everyone in town is happy to see them again. Qola, Khellis, and Icentress go to meet Mayor Deverin and inform her of the imminent threat to the town. Drakard goes to the Rusty Dragon to ask Ameiko about dragons and to get alcohol. Sarra keeps an eye on Drakard to limit the amount of trouble he can get into.",
				"Sarra and Drakard order some food and go over the book about dragons that Drakard bought in Magnimar. Meanwhile, Icentress examines the tracks around the outskirts of town and sees nothing unusual. Khells, Icentress, and Qola venture a few miles north of town and find tracks of giants and bears in the woods off the main road. They return to town and go east, where they find a small shack that has been smashed flat.",
				"After meeting up in town, the party retires early. Icentress takes first watch, Qola takes second watch, and Khellis and Sarra rise early in order to prepare themselves for the day. No one spots anything usual during the night. However, breakfast is interrupted by the lound crack of stone hitting stone. Rushing to the north gate, the PCs see three stone giants throwing boulders at the north gate and hurling insults in broken Common.",
				"The party climbs the wall and fire arrows and spells at the giants, taking one out. From the towers, they can see more giants entering the town from the east and begin stuffing citizens into sachels on their backs. The party leaves the wall and fights the giants along with the giants' dire bears, freeing the captives.",
				"A young red dragon flies across the city and begins to breath fire on the garrison, which weathers the attack fairly well. Drakard runs after the dragon and the rest of the party follows, ignoring the threats they hear from another group of giants.",
				"They catch up to the creature at the garrison and get a few ranged attacks in before it flies off to attack the cathedral. There are more cries of giants threatening Two Knights brewery, but the party decides to follow the dragon. At the cathedral Khellis' spells and Icentress' icy arrows get the dragon's attention, which lands and breaths fire on the entire party. Drakard casts <span class=\"spell-name\">slow</span> on it, and the whole party attacks. As the dragon tries to fly away, Qola's arrow brings it down.",
				"Smoke begins to rise in the direction of Scarnetti Manor, but the party ignores it to instead find the source of the earlier giant voice demanding the town turn over its greedy citizens to them. The heroes find three stone giants, one dual-wielding picks, and launch an attack that includes Icentress piercing that giant's lung. As the PCs cut down the giants, the leader blows his warhorn and sounds a retreat. One giant coming to aide his leader surrenders to the party in exchange for safe passage out of town.",
				"From him, the PCs learn that the giants' mission was to retrieve a stone from Sandpoint's Old Light and that Mokmurian is building an army of giants with which to conquer the lowlands. His base is in the Vally of the Black Tower in the Iron Peaks to the north-east, which Mokmurian has named Jorgenfist.",
				"The citizens that the party freed from the giants were able to put out the fire that started at the cathedral. Howver, Two Knights brewery has been partially destroyed and Scarnetti manor has had its windows smashed in and antiques, tapistries, and barrels of wine were stolen. 12 citizens were also carried off by the giants."
			]
		},
		{
			"id": "session20",
			"title": "Session 20",
			"date": "November 1, 2015",
			"summary": [
				"The PCs leave the shaken town of Sandpoint to seek out the Black Tower. Along the way they stop for the night at a tavern at a crossroads called The Brass Lantern, where Drakard immediately offends the gnome barowner Prixi. While Icentress and Sarra apoligize for Drakard's behavior, the bard drinks with three farmers.",
				"The farmers explain that ogres have been stealing cattle, so the party decides to do a stake-out and try to catch the ogres in the act. Drakard give the farmer enough gold to replace his lost head of cattle. That night, three ogres do arrive in the woods, which Khellis draws out with a <span class=\"spell\">cone of cold</span>. Drakard knocks out one while the other two are cut down. When interrogating him, the PCs find out that these ogres were part of a stone giant raiding party, but deserted to get tresure of their own. Drakard coup de graces the final ogre.",
				"A few days later, the party arrives at the Storval Stairs where hill giants have set up bolders and hurl them at the PCs below. Khellis and Sarra do great damage with their spells, and Drakard used <span class=\"spell\">dimentional door</span> to get Qola to the top of the stairs behind the giants. After a few more days of travel, the heros arrive at the Valley of the Black Tower."
			]
		},
		{
			"id": "session21",
			"title": "Session 21",
			"date": "November 14, 2015",
			"summary": [
				"As night falls, the party arrives at the Valley of the Black Tower. In the moonlight, they make out two small caves in the cliff wall. The first is full of deathwebs - Khellis is covered in small spiders as Qola hung back. Sarra blows the undead away with her positive energy. Stuck in the webs, the party finds a set of full-plate armor.",
				"In the other cave, the heroes are attacked by three wyverns. The beasts are defeated, but Qola gets stung by one and the party watches as the poison courses through her veins. She holds on, and Sarra heals her from the poison's effects.",
				"Deeper inside the cave, the path is blocked by Redcaps. Sarra explains that the party is only there to attack the stone giants, and the Redcaps allow the party to pass unharmed.",
				"At the end of the tunnel, a kobold barbarian blocks the path. She comes swinging for Sarra with her spear, but the party beats her down. As the kobold tries to flee, Khellis takes her out with a line of acid. Khellis takes possession of the kobold's Necklace of Fireballs.",
				"The heroes head down the next tunnel, and they can hear the sounds of someone cooking. Drakard disguises himself as a chef and attempts to talk to the female stone giant, which only angers her."
			]
		},
		{
			"id": "session22",
			"title": "Session 22",
			"date": "December 12, 2015",
			"summary": [
				"The stone giant picks up a heavy metal ladle and attacks Drakard and Icentress. The party rounds the corner or goes under the wall of furs to aide them. The female giant calls our for help from Galenmir. As Icentress defeates her with a dagger, Khellis notices a darkness rolling across the room towards him.",
				"Qola looks into the darkness and sees a stone giant weilding a pickaxe in the center. She hurls a javelin, which is deflected. As the new giant comes closer, everyone but Drakard is swallowed up in the darkness. In a panic of losing track of his comrades, Drakard blows on Terakinus' war horn.",
				"Sarra is attacked by the giant, and his ferocious blows bring her to the edge of death. Qola enters her rage, and Drakard drags the wounded Sarra away from battle. The rest of the party badly wounds the giant, and he drinks a potion. He turns into mist, which travels up and into the cracks of the stone ceiling. Drakard pours a potion of cure moderate wounds down her throat (which helps) and bourbon (which does not).",
				"Hearing the warhorn blast, four more stone giants come running into the room. Khellis is able to cast <span class=\"spell-name\">slow</span> on two of them. In her rage, Qola lets out a terrifying howl, which causes one giant to flee in terror. The other giants are defeated as Sarra recovers.",
				"With the battle finally over, a female stone giant emerges from the shadows and introduces herself as Conna. She explains that she was the matriarch of this tribe before Mokmurian slew her husband. She asks the PCs to defeat him, draws them a map of the area, and says that he should be below them on the library level. She also warns them that Mokmurian has been whispering the name &quot;Karzoug&quot; in her presence. She fears Karzoug is an ancient and powerful lord that has corrupted Mokmurain."
			]
		},
		{
			"id": "session23",
			"title": "Session 23",
			"date": "January 13, 2016",
			"summary": [
				"The party leaves Conna's chamber and sneaks past a tannery and a smithing room. As they go down a narrow tunnel Drakard peeks through a crack in the wall and sees a troll with a ranseur about to stab him. He falls to the ground with a shout and the others draw their weapons as another troll on the opposite side joins the fight. Sarra insults one of the trolls to draw it out, and Icentress catches a ranseur deep into her side.",
				"After following the winding path down, the heroes reach the library level and encounter multiple paths blocked by cave-in rubble. In the first main chamber Khellis, Sarra, Qola, and Nala are nauseated and Drakard, Qola, and Nala are shrunk. While suffering these afflictions, a hill giant covered in glowing runes moves to attack but Drakard paralyzes her. That allows the rest of the party to recover enough to help Drakard and Icentress knock the giant unconscious. After the fight, Sarra is able to dispel the magic on Qola and Drakard and return them to normal size.",
				"Peeking into the next room, Khellis recognizes a runeslave cauldron against the wall. Sarra stays out of the smoke as the others surround and defeat a massive stone golem in the room. When they finish it off, a mechanical beast with a massive maw in it's swollen stomach emerges through the wall and attacks. Sarra pierces its head and oil pours down into its eyes, forcing it to retreat.",
				"In the following room, the party discovers five giant-sized suits of armor, and one of them is missing its head. They come to life and lurch forward, pinning the party in the hallway. As some of them fall, the headless one summons human zombie minions from the ground throughout the room. Sarra is able to dispatch most of them in a blast of positive energy. The headless leader lands a heavy blow on Qola with his hatchets, but he too is taken down.",
				"In a small side room, the PCs bump back into the mechanical monster they fought before. With Qola blocking the hallway and Sarra healing her, the party finally defeat it. The heroes use the remains of the mechanical beast and the stone golem to block the hallways and rest inside the room."
			]
		},
		{
			"id": "session24",
			"title": "Session 24",
			"date": "February 6, 2016",
			"summary": [
				"Everyone takes turns standing guard as other rest. When they emerge, two lamias are standing guard on either end of the corridor. Nala disembowels one with her claws, while Sarra cuts the other's face open to keep her from speaking spells. Sarra presses the attack and cuts a massive gash up the lamia's arm, forcing her to drop her falchion. Drakard tries to disarm the disemboweled one but gets his whip pulled from his grasp. Icentress runs in close to finish the lamia off with a dagger to the kidney.",
				"After the fight, they discover a large and intricate door. Khellis' knowledge of Thassalonian history is deep enough to know the password, and the doors swing open to a library of dusty books and scrolls. Inside is a gold automaton, who the party refers to as Clockwork. As the party ask Clockwork questions, they begin learning about the history of Thassalon and the nature of the Runelords.",
				"In the next room, the PCs are assaulted by three other-worldly hounds. Qola lands a devastating blow that knocks one to the ground, and the rest of the party finish them off quickly. They open the next door and a wall of fog rolls over them.",
				"Sarra casts an <span class=\"spell-name\">anti-magic field</span> and the party huddles inside it as they follow the stone wall of the room. When they emerge, the sight of an angry floating stone giant greets them. Khellis is the first to step out of the field and cast a spell, which draws the giant's attention. Khellis is hit by <span class=\"spell-name\">scorching ray</span> and <span class=\"spell-name\">disintegrate</span>, which vaporizes the wizard. A man down, Sarra dismisses the field and the party attacks the giant head-on. They defeat him, and as he dies the giant's eyes glow green and a strang voice speaks through his mouth - it threatens that Karzoug will see to their defeat and Xin-Shalast will rise again."
			]
		},
		{
			"id": "session25",
			"title": "Session 25",
			"date": "February 27, 2016",
			"summary": [
				"A potal opens in the room and a elven woman enters, crossbow raised and asks &quot;Where is my brother?&quot;. She explains that she is Khellis' half-sister Rina Osiric and demands to know what happened to him. Before the party can fully explain the doors fly open and eight stone giants enter the room, including the general Galenmir and Conna. Galenmir demands the party surrender or die, but Conna asserts that by succession she is the new tribe leader unless defeated in combat. Three of the stone giants side with her. Galenmir attempts to intimidate the others into staying loyal to him, but Qola is just as intimidating and Sarra's speech inspires them to also turn against Galenmir. The six giants lead him away to a cell, and Conna thanks the party for restoring her rule.",
				"With the immediate crisis over, Qola scoops up Khellis' remains into her jerky bag. Rina explains that she and Khellis are half-siblings through their father, and adventured together until recently. She is determined to resurrect her brother with or without the others' help, but they agree to aide her. Before leaving, the PCs return to the library to research Xin-Shalast.",
				"The party travels back to Turtleback Ferry to ride the boat back to Magnimar. Along the way, Drakard and Sarra slip down to the cargo hold where he reveals to her the fall of the House Rynell, his alcoholism, and his obsession with dragons. He also asks her that if something were to happen to him Sarra would assume responibility of the House Rynell, which she accepts. Unbeknown to the both of them, Icentress had followed them and heard the heart-to-heart.",
				"In Magnimar, Icentress gives Sarra her portion of the cost to resurrect their friend, but decides to remain outside of town. Sarra, Drakard, and Risa go to the temple to Nethys to secure their help and learn where they can find a diamond to use for the <span class=\"spell-name\">resurrection</span> spell. Meanwhile, Qola meets her underground contacts to inquire about the same. Everyone meets back at the same jewelry store, and they are able to purchase it from the elven clerk. Meanwhile, Icentress and Nala hunt rabbits in the fields.",
				"Back at the temple, Sarra prepares the spell. When it is cast, they awaken in a grey plane and face-to-face with a winged elven woman. She says that the soul of their friend is hers, unless they can defeat her in battle. While Rina prepares spells on her bolts, the valkyrie summons an arena and storm clouds. The battle begins, and Risa delivers devastating hits with her crossbow. Bloodied and defeated, the valkyrie produces Khellis' soul from her spear and everyone awakens back in Magnimar which Khellis wearing Qola's jerky bag.",
				"The party assembled, they spend the night in Khellis' magical mansion. Rina and Khellis stay up late into the night talking, and Rina leaves on better terms with her brother."
			]
		}
	]
}