{
	"chapter_name": "Chapter 2",
	"sessions": [
		{
			"id": "session08",
			"title": "Session 08",
			"date": "September 13, 2014",
			"summary": [
				"Three weeks pass. Icentress teaches Shadowmist a few commands and acquires a mountain lion as an animal companion. Drakard performed in the Rusty Dragon, and gave his earning to Ameiko to cover his ale consumption.",
				"The party learns from Sherriff Hemlock that a murder occurred in the Sandpoint sawmill the night before, and asks them to investigate. He also gives them a threatening note found at the scene and addressed to Icentress, signed \"Your Lordship.\" They find footprints leading to and from the nearby river, an axe strong with the rotten smell of death, and Harker's body covered in claw wounds.",
				"From interviewing Ibor Thorn, the sawmill worker who found the murder scene that morning, the party finds out that Harker was embezzling money from the sawmill's operations. When they interview Ven Vinder, the father of the female victim, he is belligerent and screaming at the PCs. After being intimidated by Qola, he breaks down into tears instead.",
				"The party visits Habe's sanatorium, where the only surviving person from a set of murders two days prior was being held. Sarra was able to diagnose the victim Tabe as suffering from ghoul fever. Tabe delivered a message to Icentress from Your Lordship, then broke free of his straitjacket and attacked but was put down by a scorching ray from Khellis.",
				"The party also met Brodert Quink, a local scholar of Varisian history. Sarra and Brodert go over the seven pointed star the party has been encountering and that has been carved into the chests of the recent murder victims. They identify it as the Sihedron Rune and discuss the symbol's various meanings."
			]
		},
		{
			"id": "session09",
			"title": "Session 09",
			"date": "October 04, 2014",
			"summary": [
				"A farmer covered it dirt, sweat, and blood collapses just beyond the Sandpoint gates, begging for help. He describes walking scarecrows attacking farmsteads and consuming their victims. The party heads out to investigate.",
				"South of town, they discover a wide field of tall grasses and wheat crops. As they walk down the narrow pathways, a group of scarecrows rip themselves from their posts and attack. After defeating then, Sarra identifies them as ghouls.",
				"The PCs grow cautious as some scarecrows are just that, while others are ghouls that leap to attack. However, as they complete a circuit of the fields, the party rescues a brother and sister who had been infected with ghoul fever and left tied to posts. Drakard gives the children daggers for protection, and the party instructs them to follow the northern road back to Sandpoint for help.",
				"In the middle of the field they find a farmhouse. While the other party members stand outside, Sarra sneaks through the back door and destroys all the undead inside with a single blast of divine energy. In the farmhouse they find a lockbox with silver pieces and an ornate key. Inside the barn is another note addressed to Icentress and signed \"Your Lordship.\"",
				"The party moves on to Foxglove Manor, a once-stately house in a state of decay and disrepair. The key they had found opens the front door, and a strong musky odor washes over them. Qola is assaulted by a vision of a flaming manitcore, and Khellis is put under a strange trance. Shouting at Drakard to leave the house, Khellis drags Drakard outside where the two are attacked by a swarm of crows. Regaining his senses, Khellis dispurses the murder with a <span class=\"spell-name\">fireball</span>.",
				"In a drawing room, Qola discovers a fine red scarf and puts it on. As she walks by Icentress, the scarf comes to life and being choking Icentress. Quickly, the ranger pulls her dagger and sunders the scarf in two, much to Qola's disappointment."
			]
		},
		{
			"id": "session10",
			"title": "Session 10",
			"date": "November 01, 2014",
			"summary": [
				"The party continues to explore Foxglove Manor. In one room, they find a series of portraits showing multiple generations of the Foxglove family. The room erupts into a wave of black mold and fungi that just as suddenly recedes. Drakard shows signs of a fungal infection.",
				"In the observatory, they find two stained glass windows; one of them is shattered. Qola shouts of being consumed by fire, and begins to charge at the unbroken window. The party shoves her away until Drakard can cast <span class=\"spell-name\">hideous laughter</span>, which takes Qola to the ground long enough for the impulse to pass.",
				"In the attic, the PCs discover what is left of Iesha Foxglove, now a wretched undead creature shrieking in sorrow at its own reflection. When they break the mirror, Iesha angrily shouts out for Aldern and begins to march to the main floor. The party follows, where in the main hallway Iesha levitates the floorboards to reveal a staircase and leaps down, sealing the floor behind her. The PCs find a staircase and also descend.",
				"In the basement, they discover a workshop. On the floor is a strange and shattered box that they identify as a damaged phylactery. When the PCs find the stairs Iesha went down, they are attacked by more ghouls and a massive bat.",
				"In a large pit in the back of the cavern the party fights off a group of goblin ghasts and catches up to Iesha, witnessing her break through a stone door. A hideous man steps out dressed in Aldern's finery. He begs forgiveness from Iesha, who glares at him in silence before shrieking and slashing his face open with her claws.",
				"The man identifies himself to Icentress as \"Your Lordship\" and warns that \"The Hurter\" will return soon. As he begins to explain his debt to the Brothers of the Seven, his face twists into a hideous snarl and his tounge rolls out of his mouth. He declares himself to be The Skinsaw Man, and charges at Icentress. The party along with Iesha surround and defeat him. Afterwards, Iesha thanks the PCs for allowing her to finally rest and crumbles into dust. Inside The Skinsaw Man's room the PCs discover a note addressed to Aldern, signed \"Xanesha, Mistress of the Seven,\" and emblazoned with the Sihedron Rune."
			]
		},
		{
			"id": "session11",
			"title": "Session 11",
			"date": "December 20, 2014",
			"summary": [
				"The party travels to Magnimar. Drakard disguises himself as Aldern Foxglove and the party enters the Foxglove's townhouse in the city, only to find themselves face-to-face with Aldern and Ieasha Foxglove.",
				"The Foxgloves at home in the townhouse are really shapeshifters, who attack and are defeated by the party. Our heroes bury the bodies in the backyard of the townhouse.",
				"The afternoon is spent observing the Seven's Sawmill in the south-east of the city while Drakard talks up Gloin, a dwarven bartender at a high-end wine bar called Spirits.",
				"At midnight, a man is brought into the sawmill. The party follows, only to discover a group of scarlet-clad cultists performing a ritual. As the Sihedron rune is being carved into the man's chest, the party strikes. Khellis attempts to catch the entire group in a mass of tentacles, but fails and instead draws the attention of all present. The party holds the stairwell and slowly cut down the cult members.",
				"The man they save explains that he was gambling on dice in a back-alley of the Underbridge when he was attacked. The other gamblers were killed, but he was knocked out and brought to the sawmill.",
				"At the top of the sawmill was a group of trained messanger ravens. With the <span class=\"spell-name\">light</span> spell cast on the bird, Icentress watches it fly to the rotting bell tower in the Underbridge.",
				"The next day, our heroes arrive at the base of the Shadow Clock. As they begin climbing, a massive golem dressed as a scarecrow attacks. Both Khellis and Sarra attack with their spells, but they have no effect. Qola and Icentress bring the golem crashing down through sheer force.",
				"As they climb higher, one of the bells comes crashing down through the tower. Khellis flys to the top and sees three more shapeshifters were responsible for cutting the support ropes. The enemies are knocked off their perches by Nala and Khellis.",
				"At the top of the tower, the party discovers a nest of fine cloths and silks. Khellis casts <span class=\"spell-name\">see invisibility</span> and sees a large half woman, half snake creature in the corner armed with a large spear. Khellis and Drakard use flour and glitterdust to expose the creature, and the party attacks. Khellis' spells pin the creature to one side of the room, until she turns him to stone with her mask. Qola keeps her attention, while Sarra tends to Qola, Icentress uses her arrows, and Drakard hides behind a statue to perform and inspire the party.",
				"Xanesha is defeated, and in her nest they find a letter from her sister in Turtleback Ferry, claiming that her operation there was better than the one in Magnimar. The note concludes with an ominous questions - has the lord-mayor been sacrificed yet?"
			]
		}
	]
}