{
	"chapter_name": "Chapter 4",
	"sessions": [
		{
			"id": "session19",
			"title": "Session 19",
			"date": "October 3, 2015",
			"summary": [
				"The party takes the ferry back to Magnimar to resuppy, then travels over land back to Sandpoint. The town is as they left it, and (almost) everyone in town is happy to see them again. Qola, Khellis, and Icentress go to meet Mayor Deverin and inform her of the imminent threat to the town. Drakard goes to the Rusty Dragon to ask Ameiko about dragons and to get alcohol. Sarra keeps an eye on Drakard to limit the amount of trouble he can get into.",
				"Sarra and Drakard order some food and go over the book about dragons that Drakard bought in Magnimar. Meanwhile, Icentress examines the tracks around the outskirts of town and sees nothing unusual. Khells, Icentress, and Qola venture a few mines north of town and find tracks of giants and bears in the woods off the main road. They return to town and go east, where they find a small shack that has been smashed flat.",
				"After meeting up in town, the party retires early. Icentress takes first watch, Qola takes second watch, and Khellis and Sarra rise early in order to prepare themselves for the day. No one spots anything usual during the night. However, breakfast is interrupted by the lound crack of stone hitting stone. Rushing to the north gate, the PCs see three stone giants throwing boulders at the north gate and hurling insults in broken Common.",
				"The party climbs the wall and fire arrows and spells at the giants, taking one out. From the towers, they can see more giants entering the town from the east and begin stuffing citizens into sachels on their backs. The party leaves the wall and fights the giants along with the giants' dire bears, freeing the captives.",
				"A young red dragon flies across the city and begins to breath fire on the garrison, which weathers the attack fairly well. Drakard runs after the dragon and the rest of the party follows, ignoring the threats they hear from another group of giants.",
				"They catch up to the creature at the garrison and get a few ranged attacks in before it flies off to attack the cathedral. There are more cries of giants threatening Two Knights brewery, but the party decides to follow the dragon. At the cathedral Khellis' spells and Icentress' icy arrows get the dragon's attention, which lands and breaths fire on the entire party. Drakard casts <span class=\"spell-name\">slow</span> on it, and the whole party attacks. As the dragon tries to fly away, Qola's arrow brings it down.",
				"Smoke begins to rise in the direction of Scarnetti Manor, but the party ignores it to instead find the source of the earlier giant voice demanding the town turn over its greedy citizens to them. The heroes find three stone giants, one dual-wielding picks, and launch an attack that includes Icentress piercing that giant's lung. As the PCs cut down the giants, the leader blows his warhorn and sounds a retreat. One giant coming to aide his leader surrenders to the party in exchange for safe passage out of town.",
				"From him, the PCs learn that the giants' mission was to retrieve a stone from Sandpoint's Old Light and that Mokmurian is building an army of giants to conquer the lowlands with. His base is in the Vally of the Black Tower in the Iron Peaks to the north-east, which Mokmurian has named Jorgenfist.",
				"The citizens that the party freed from the giants were able to put out the fire that started at the cathedral. Howver, Two Knights brewery has been partially destroyed and Scarnetti manor has had its windows smashed in and antiques, tapistries, and barrels of wine were stolen. 12 citizens were also carried off by the giants."
			]
		},
		{
			"id": "session20",
			"title": "Session 20",
			"date": "November 1, 2015",
			"summary": [
				"The PCs leave the shaken town of Sandpoint to seek out the Black Tower. Along the way they stop for the night at a tavern at a crossroads called The Brass Lantern, where Drakard immediately offends the gnome barowner Prixi. While Icentress and Sarra apoligize for Drakard's behavior, the bard drinks with three farmers.",
				"The farmers explain that ogres have been stealing cattle, so the party decides to do a stake-out and try to catch the ogres in the act. Drakard give the farmer enough gold to replace his lost head of cattle. That night, three ogres do arrive in the woods, which Khellis draws out with a <span class=\"spell\">cone of cold</span>. Drakard knocks out one while the other two are cut down. When interrogating him, the PCs find out that these ogres were part of a stone giant raiding party, but deserted to get tresure of their own. Drakard coup de graces the final ogre.",
				"A few days later, the party arrives at the Storval Stairs where hill giants have set up bolders and hurl them at the PCs below. Khellis and Sarra do great damage with their spells, and Drakard used <span class=\"spell\">dimentional door</span> to get Qola to the top of the stairs behind the giants. After a few more days of travel, the heros arrive at the Valley of the Black Tower."
			]
		},
		{
			"id": "session21",
			"title": "Session 21",
			"date": "November 14, 2015",
			"summary": [
				"As night falls, the party arrives at the Valley of the Black Tower. In the moonlight, they make out two small caves in the cliff wall. The first is full of deathwebs - Khellis is covered in small spiders as Qola hung back. Sarra blows the undead away with her positive energy. Stuck in the webs, the party finds a set of full-plate armor.",
				"In the other cave, the heroes are attacked by three wyverns. The beasts are defeated, but Qola gets stung by one and the party watches as the poison courses through her veins. She holds on, and Sarra heals her from the poison's effects.",
				"Deeper inside the cave, the path is blocked by Redcaps. Sarra explains that the party is only there to attack the stone giants, and the Redcaps allow the party to pass unharmed.",
				"At the end of the tunnel, a kobold barbarian blocks the path. She comes swinging for Sarra with her spear, but the party beats her down. As the kobold tries to flee, Khellis takes her out with a line of acid. Khellis takes possession of the kobold's Necklace of Fireballs.",
				"The heroes head down the next tunnel, and they can hear the sounds of someone cooking. Drakard disguises himself as a chef and attempts to talk to the female stone giant, which only angers her."
			]
		},
		{
			"id": "session22",
			"title": "Session 22",
			"date": "December 12, 2015",
			"summary": [
				"Coming soon..."
			]
		}
	]
}